#ifndef ENGINE_H
#define ENGINE_H



//===================================================================================================
#include "Border.h"
#include "Ball.h"
#include "Platform.h"
//===================================================================================================
enum E_Key_Type {
	EKT_Left,
	EKT_Right,
	EKT_Space
};
//===================================================================================================
class C_s_Engine {
public:																			// ------------------
	void Init(HWND hWnd);														// > Настройка игры при старте
	void Draw_Frame(HDC hdc, RECT& paint_area);									// > Отрисовка экрана игры
	int On_Key_Down(E_Key_Type key_type);										// > Обработка нажатых клавиш
	int On_Timer();																// > Обработка таймера
																				// ------------------
	HWND HWnd;																	// > Дескриптор окна			
	HPEN BG_Pen;																// > Перо для рисования заднего фона
	HBRUSH BG_Brush;															// > Кисть для рисования заднего фона
private:																		// ------------------
	C_Ball Ball;																// > Шарик
	C_Level Level;																// > Уровень
	C_s_Platform Platform;														// > Платформа
	C_s_Border Border;															// > Рамка
};
//===================================================================================================



#endif