#ifndef PLATFORM_H
#define PLATFORM_H


//===================================================================================================
#include "Config.h"
//===================================================================================================
class C_s_Platform {
public:																			// ------------------
	C_s_Platform();																//
	void Init();																// > Настройка платформы при старте
	void Draw(HDC hdc, HPEN bg_pen, HBRUSH bg_brush, RECT& paint_area);			// > Отрисовка платформы
	void Redraw(HWND hwnd);														// > Перерисовка платформы при её перемещении

	short X_Pos;																// > Позиция платформы по оси Ох
	BYTE Width;																	// > Полная ширина платформы
private:																		// ------------------
	static const BYTE Circle_Size = 7;											// > Диаметр колёсиков платформы
	static const BYTE Height = 7;												// > Высота платформы
	// ------------------
	BYTE Inner_Width;															// > Внутренняя ширина платформы (ширина доски)
	RECT Rect, Prev_Rect;														// > Прямоугольники рисования
	HPEN Red_Pen, Blue_Pen;														// > Перья и кисти для рисования платформы
	HBRUSH Red_Brush, Blue_Brush;												//   (красный и синий цвета)
};
//===================================================================================================



#endif // !PLATFORM_H

